<h2> Pandas </h2><br>
 * Series (1차원배열)

In [2]:
import pandas as pd
import numpy as np

In [2]:
obj=pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2=pd.Series(["red","green","blue","black","orange"], index=[1,2,3,4,5])
obj2

1       red
2     green
3      blue
4     black
5    orange
dtype: object

In [8]:
obj2[3]

'blue'

In [9]:
obj2[4]="yellow"
obj2

1       red
2     green
3      blue
4    yellow
5    orange
dtype: object

In [12]:
obj2[4]=None
obj2

1       red
2     green
3      blue
4      None
5    orange
dtype: object

In [13]:
obj2.isnull()

1    False
2    False
3    False
4     True
5    False
dtype: bool

In [14]:
obj2[2]

'green'

In [15]:
obj2.loc[2]

'green'

In [17]:
obj2.iloc[2]

'blue'

In [18]:
color=pd.Series(["red","green","blue","yellow","gray"],index=[100,120,125,127,130])
color

100       red
120     green
125      blue
127    yellow
130      gray
dtype: object

In [19]:
print(color.loc[127])
print(color.iloc[3])

yellow
yellow

In [21]:
data=np.arange(10,60,10)
pandas=pd.Series(["red","green","blue","balck","yellow"],index=data)
print(pandas)

10       red
20     green
30      blue
40     balck
50    yellow
dtype: object

* 산술연산

In [24]:
a=pd.Series([10,20,30,40,50],index=["a","b","c","d","e"])
a

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [28]:
#a+10
#a*10
#a**2
a/2

a     5.0
b    10.0
c    15.0
d    20.0
e    25.0
dtype: float64

In [29]:
a>30

a    False
b    False
c    False
d     True
e     True
dtype: bool

In [30]:
a[a>30]

d    40
e    50
dtype: int64

In [31]:
a[a<=30]

a    10
b    20
c    30
dtype: int64

* 집계함수

In [32]:
a=pd.Series([10,20,30,40,50],index=["a","b","c","d","e"])
a

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [33]:
a.add(5)

a    15
b    25
c    35
d    45
e    55
dtype: int64

In [34]:
a.sub(3)

a     7
b    17
c    27
d    37
e    47
dtype: int64

In [35]:
a.mul(2)

a     20
b     40
c     60
d     80
e    100
dtype: int64

In [36]:
a.div(3)

a     3.333333
b     6.666667
c    10.000000
d    13.333333
e    16.666667
dtype: float64

In [37]:
a.mod(3)

a    1
b    2
c    0
d    1
e    2
dtype: int64

In [38]:
a.min()

10

In [40]:
a.max()

50

In [41]:
print(a.sum())
print(a.mean())
print(a.median())
print(a.std())
print(a.var())

150
30.0
30.0
15.811388300841896
250.0

* DataFrame <br>
행과 열로 구성된 2차원 데이터 구조 (Data Structure)

In [3]:
rawData=np.random.randint(50,100,size=(4,3))
rawData

array([[95, 94, 70],
       [74, 88, 61],
       [94, 60, 81],
       [66, 71, 68]])

In [4]:
df=pd.DataFrame(rawData,index=["1반","2반","1반","2반"],columns=["kor","eng","mat"])
df

    kor  eng  mat
1반   95   94   70
2반   74   88   61
1반   94   60   81
2반   66   71   68

In [5]:
df["kor"]

1반    95
2반    74
1반    94
2반    66
Name: kor, dtype: int32

In [7]:
df["avg"]=round((df["kor"]+df["eng"]+df["mat"])/3,2)
df

    kor  eng  mat    avg
1반   95   94   70  86.33
2반   74   88   61  74.33
1반   94   60   81  78.33
2반   66   71   68  68.33

In [8]:
df[df.avg>75]

    kor  eng  mat    avg
1반   95   94   70  86.33
1반   94   60   81  78.33

In [11]:
# res를 추가하시오(평균이 60이상이면 pass, 70미만이면 fail)
# kor eng  mat  avg   res
# ----------------------------
# 77   59   80  72.0  pass
#            :
if df.avg>=60 then res="pass"
else res="fail"

SyntaxError: invalid syntax (<ipython-input-11-e44291134701>, line 6)

In [10]:
df

    kor  eng  mat    avg
1반   95   94   70  86.33
2반   74   88   61  74.33
1반   94   60   81  78.33
2반   66   71   68  68.33

In [12]:
del df["avg"]
df

    kor  eng  mat
1반   95   94   70
2반   74   88   61
1반   94   60   81
2반   66   71   68

In [14]:
df=df.drop(["mat"],axis="columns")
df

    kor  eng
1반   95   94
2반   74   88
1반   94   60
2반   66   71

* 결측값 처리

In [42]:
df=pd.DataFrame(rawData,index=["1반","2반","1반","2반"],columns=["kor","eng","mat"])
df

    kor  eng  mat
1반   95   94   70
2반   74   88   61
1반   94   60   81
2반   66   71   68

In [43]:
df=df.astype("float64")
df

     kor   eng   mat
1반  95.0  94.0  70.0
2반  74.0  88.0  61.0
1반  94.0  60.0  81.0
2반  66.0  71.0  68.0

In [44]:
df["mat"][2]=np.nan
df

     kor   eng   mat
1반  95.0  94.0  70.0
2반  74.0  88.0  61.0
1반  94.0  60.0   NaN
2반  66.0  71.0  68.0

In [22]:
#df.dropna(axis=0)                #원본수정안함
df.dropna(axis=0, inplace=True)  #원본수정

In [23]:
df

     kor   eng   mat
1반  95.0  94.0  70.0
2반  74.0  88.0  61.0
2반  66.0  71.0  68.0

In [27]:
df

     kor   eng   mat
1반  95.0  94.0  70.0
2반  74.0  88.0  61.0
1반  94.0  60.0   NaN
2반  66.0  71.0  68.0

In [28]:
df.dropna(axis=1)

     kor   eng
1반  95.0  94.0
2반  74.0  88.0
1반  94.0  60.0
2반  66.0  71.0

In [32]:
df

     kor   eng   mat
1반  95.0  94.0  70.0
2반  74.0  88.0  61.0
1반  94.0  60.0   NaN
2반  66.0  71.0  68.0

In [33]:
df.fillna("결시")

     kor   eng   mat
1반  95.0  94.0  70.0
2반  74.0  88.0  61.0
1반  94.0  60.0    결시
2반  66.0  71.0  68.0

In [37]:
df.fillna("결시")

     kor   eng   mat
1반  95.0  94.0  70.0
2반  74.0  88.0  61.0
1반  94.0  60.0    결시
2반  66.0  71.0  68.0

* Multi Index

In [46]:
df=pd.DataFrame(rawData,index=["1반","2반","1반","2반"],columns=["kor","eng","mat"])
df=df.astype("float64")
df["mat"][2]=np.nan
df

     kor   eng   mat
1반  95.0  94.0  70.0
2반  74.0  88.0  61.0
1반  94.0  60.0   NaN
2반  66.0  71.0  68.0

In [47]:
df.T

       1반    2반    1반    2반
kor  95.0  74.0  94.0  66.0
eng  94.0  88.0  60.0  71.0
mat  70.0  61.0   NaN  68.0

* 데이터 사전분석

In [50]:
df=pd.DataFrame(rawData,index=["1반","2반","1반","2반"],columns=["kor","eng","mat"])
df=df.astype("float64")
df["mat"][2]=np.nan
df.index=[['1학년','1학년','2학년','2학년'],
          ['1반','2반','1반','2반']]
df.columns=[['언어','언어','수리'],['국어','영어','수학']]
df

          언어          수리
          국어    영어    수학
1학년 1반  95.0  94.0  70.0
    2반  74.0  88.0  61.0
2학년 1반  94.0  60.0   NaN
    2반  66.0  71.0  68.0

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 4 entries, ('1학년', '1반') to ('2학년', '2반')
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   (언어, 국어)  4 non-null      float64
 1   (언어, 영어)  4 non-null      float64
 2   (수리, 수학)  3 non-null      float64
dtypes: float64(3)
memory usage: 384.0+ bytes

In [52]:
df.describe()

             언어                    수리
             국어         영어         수학
count   4.00000   4.000000   3.000000
mean   82.25000  78.250000  66.333333
std    14.52297  15.585784   4.725816
min    66.00000  60.000000  61.000000
25%    72.00000  68.250000  64.500000
50%    84.00000  79.500000  68.000000
75%    94.25000  89.500000  69.000000
max    95.00000  94.000000  70.000000

In [53]:
df.isnull()

           언어            수리
           국어     영어     수학
1학년 1반  False  False  False
    2반  False  False  False
2학년 1반  False  False   True
    2반  False  False  False

In [54]:
df.isnull().sum()

언어  국어    0
    영어    0
수리  수학    1
dtype: int64

* 값의 연결

In [56]:
a=pd.DataFrame(np.arange(1,10).reshape(3,3))
a

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [57]:
b=pd.Series(np.arange(10,40,10))
b

0    10
1    20
2    30
dtype: int32

In [58]:
pd.concat([a,b],axis=1)  #0은 열 1은 행

   0  1  2   0
0  1  2  3  10
1  4  5  6  20
2  7  8  9  30

In [59]:
pd.concat([a,b],axis=1,ignore_index=True)

   0  1  2   3
0  1  2  3  10
1  4  5  6  20
2  7  8  9  30

In [60]:
a.append(b,ignore_index=True)

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  20  30

* 엑셀파일 불러오기

In [72]:
file="C:/Users/gram/pythonExam/test.xlsx"
#xl=pd.ExcelFile(file)
#df=xl.parse('Sheet1')
df=pd.read_excel(file)
print(df)

    Unnamed: 0 name  kor  eng  mat
0            0    A   80   80   80
1            1    B  100   80   80
2            2    C   80  100   55
3            3    D   80   80   80
4            4    E   80   55   55
5            5    F   55   80   80
6            6    G   80   80   80
7            7    H   55   80  100
8            8    I   80   80   80
9            9    J   80   80  100
10          10    K   80   80   80
11          11    L   47   80   80
12          12    M   80   80   80
13          13    N  100   80   55
14          14    O   80   65  100

In [68]:
import pandas as pd
f=pd.read_excel(r'C:/Users/gram/pythonExam/test.xlsx')
f

    Unnamed: 0 name  kor  eng  mat
0            0    A   80   80   80
1            1    B  100   80   80
2            2    C   80  100   55
3            3    D   80   80   80
4            4    E   80   55   55
5            5    F   55   80   80
6            6    G   80   80   80
7            7    H   55   80  100
8            8    I   80   80   80
9            9    J   80   80  100
10          10    K   80   80   80
11          11    L   47   80   80
12          12    M   80   80   80
13          13    N  100   80   55
14          14    O   80   65  100